Intergrate new rating system into core codes.
